Repository: ndim/libgphoto2
Catalog: libgphoto2_port/po/*.po
Languages: fur

source: Generic Port
fur: Puarte gjeneriche

source: No error
fur: Nissun erôr

source: Unspecified error
fur: Erôr no specificât

source: I/O problem
fur: Probleme di I/O

source: Bad parameters
fur: Parametris sbaliâts

source: Unsupported operation
fur: Operazion no supuartade

source: Fixed limit exceeded
fur: Limit fis superât

source: Timeout reading from or writing to the port
fur: Timp scjadût tal lei de o tal scrivi su la puarte

source: Serial port not supported
fur: Puarte seriâl no supuartade

source: USB port not supported
fur: Puarte USB no supuartade

source: Unknown port
fur: Puarte no cognossude

source: Out of memory
fur: Memorie finide

source: Error loading a library
fur: Erôr tal cjariâ une librarie

source: Error initializing the port
fur: Erôr tal inizializâ la puarte

source: Error reading from the port
fur: Erôr tal lei de puarte

source: Error writing to the port
fur: Erôr tal scrivi su la puarte

source: Error updating the port settings
fur: Erôr tal inzornâ lis impostazions de puarte

source: Error setting the serial port speed
fur: Erôr tal configurâ la velocitât de puarte seriâl

source: Error clearing a halt condition on the USB port
fur: Erôr tal netâ une condizion di halt su la puarte USB

source: Could not find the requested device on the USB port
fur: Nol è stât pussibil cjatâ su la puarte USB il dispositîf domandât

source: Could not claim the USB device
fur: Nol è stât pussibil rivendicâ il dispositîf USB

source: Could not lock the device
fur: Nol è stât pussibil blocâ il dispositîf

source: libhal error
fur: Erôr di libhal

source: Unknown error
fur: Erôr no cognossût

source: The operation '%s' is not supported by this device
fur: La operazion '%s' no je supuartade di chest dispositîf

source: The port has not yet been initialized
fur: La puarte no je stade ancjemò inizializade

source: low
fur: bas

source: high
fur: alt

source: No error description available
fur: Nissune descrizion di erôr disponibile

source: Media '%s'
fur: Supuart '%s'

source: Could not open USB device (%s).
fur: Impussibil vierzi il dispositîf USB (%s).

source: Camera is already in use.
fur: La fotocjamare e je za in ûs.

source: Could not detach kernel driver of camera device.
fur: Nol è stât pussibil distacâ il driver dal kerne dal dispositîf de fotocjamare.

source: Could not query kernel driver of device.
fur: Nol è stât pussibil interogâ il driver dal kernel dal dispositîf.

source: Could not claim interface %d (%s). Make sure no other program (%s) or kernel module (such as %s) is using the device and you have read/write access to the device.
fur: Nol è stât pussibil rivendicâ la interface %d (%s). Controle che nissun altri program (%s) o modul di kernel (come %s) al stedi doprant il dispositîf e che tu vedis acès in leture/scriture al dispositîf.

source: MacOS PTPCamera service
fur: Servizi PTPCamera di MacOS

source: unknown libgphoto2 using program
fur: program che al dopre libgphoto2 no cognossût

source: Could not release interface %d (%s).
fur: Nol è stât pussibil molâ la interface %d (%s).

source: Could not reset USB port (%s).
fur: Nol è stât pussibil azerâ la puarte USB (%s).

source: Could not reattach kernel driver of camera device.
fur: Nol è stât pussibil tornâ a tacâ il driver dal kernel dal dispositîf de fotocjamare.

source: Could not set config %d/%d (%s)
fur: Nol è stât pussibil stabilî la configurazion %d/%d (%s)

source: Could not set altsetting from %d to %d (%s)
fur: Nol è stât pussibil configurâ altsetting di %d a %d (%s)

source: Could not find USB device (vendor 0x%x, product 0x%x). Make sure this device is connected to the computer.
fur: Nol è stât pussibil cjatâ il dispositîf USB (produtôr 0x%x, prodot 0x%x). Controle che chest dispositîf al sedi colegât al computer.

source: The supplied vendor or product id (0x%x,0x%x) is not valid.
fur: Il produtôr indicât o l'id dal prodot (0x%x,0x%x) nol è valit.

source: Could not find USB device (class 0x%x, subclass 0x%x, protocol 0x%x). Make sure this device is connected to the computer.
fur: Nol è stât pussibil cjatâ il dispositîf USB (classe 0x%x, sot-classe 0x%x, protocol 0x%x). Controle che chest dispositîf al sedi colegât al computer.

source: PTP/IP Connection
fur: Conession PTP/IP

source: IP Connection
fur: Conession IP

source: Could not lock device '%s'
fur: Nol è stât pussibil blocâ il dispositîf '%s'

source: Device '%s' is locked by pid %d
fur: Il dispositîf '%s' al è blocât dal pid %d

source: Device '%s' could not be locked (dev_lock returned %d)
fur: Nol è stât pussibil blocâ il dispositîf '%s' (dev_lock al à tornât %d)

source: Device '%s' could not be unlocked.
fur: Nol è stât pussibil sblocâ il dispositîf '%s'.

source: Device '%s' could not be unlocked as it is locked by pid %d.
fur: Nol è stât pussibil sblocâ il dispositîf '%s' viodût che al è blocât dal pid %d.

source: Device '%s' could not be unlocked (dev_unlock returned %d)
fur: Nol è stât pussibil sblocâ il dispositîf '%s' (dev_unlock al à tornât %d)

source: Serial Port %i
fur: Puarte seriâl %i

source: Serial Port Device
fur: Dispositîf de puarte seriâl

source: Failed to open '%s' (%s).
fur: Impussibil vierzi '%s' (%s).

source: Could not close '%s' (%s).
fur: Nol è stât pussibil sierâ '%s' (%s).

source: Could not write to port (%s)
fur: Nol è stât pussibil scrivi su la puarte (%s)

source: Parity error.
fur: Erôr di paritât.

source: Unexpected parity response sequence 0xff 0x%02x.
fur: Secuence di rispueste de paritât 0xff 0x%02x inspietade.

source: Unknown pin %i.
fur: Pin %i no cognossût.

source: Could not get level of pin %i (%s).
fur: Nol è stât pussibil otignî il nivel dal pin %i (%s).

source: Could not set level of pin %i to %i (%s).
fur: Nol è stât pussibil stabilî il nivel dal pin %i a %i (%s).

source: Could not flush '%s' (%s).
fur: Nol è stât pussibil disvuedâ '%s' (%s).

source: Could not set the baudrate to %d
fur: Nol è stât pussibil configurâ la velocitât di trasmission a %d

source: Could not detach kernel driver '%s' of camera device.
fur: Nol è stât pussibil distacâ il driver dal kernel '%s' dal dispositîf de fotocjamare.

source: Could not close USB port (%s).
fur: Nol è stât pussibil sierâ la puarte USB (%s).

source: USB Mass Storage direct IO
fur: IO diret de memorie di masse USB

source: Failed to open '%s' (%m).
fur: Impussibil vierzi '%s' (%m).

source: Could not close '%s' (%m).
fur: Nol è stât pussibil sierâ '%s' (%m).

source: Could not seek to offset: %x on '%s' (%m).
fur: Nol è stât pussibil cirî fin te deviazion: %x su '%s' (%m).

source: Could not write to '%s' (%m).
fur: Nol è stât pussibil scrivi su '%s' (%m).

source: Could not read from '%s' (%m).
fur: Nol è stât pussibil lei di '%s' (%m).

source: Device '%s' is locked by another app.
fur: Il dispositîf '%s' al è blocât di une altre aplicazion.

source: Failed to lock '%s' (%m).
fur: Impussibil blocâ '%s' (%m).

source: Failed to unlock '%s' (%m).
fur: Impussibil sblocâ '%s' (%m).

source: USB Mass Storage raw SCSI
fur: SCSI grês de memorie di masse USB

source: Could not send scsi command to: '%s' (%m).
fur: Nol è stât pussibil inviâ il comant scsi a: '%s' (%m).
